# Taps
tap "homebrew/bundle"

# Infrastructure-as-Code
brew "ansible"
brew "ansible-lint"
brew "opentofu"

# SSH Key Management
cask "secretive"

# Default Terminal Replacement
cask "ghostty"
# CLI Tools
brew "bat"
brew "broot"
brew "fd"
brew "htop"
brew "ncdu"
brew "neofetch"
brew "ripgrep"
brew "tig"
brew "tmux"
brew "tree"
brew "wget"

# Programming Languages
# Go
brew "go"

# Cloud
# Hetzner
brew "hcloud"

# Local Kubernetes / Container Setup
brew "kubernetes-cli"
cask "docker"
brew "podman"
brew "minikube"

# VPNs
# Homeserver / Private Cloud
brew "tailscale"
# University
cask "tunnelblick"
# Wireguard
brew "wireguard-go"
brew "wireguard-tools"

# Messaging
# Discord
cask "discord"
# Signal
cask "signal"

# Password Manager
cask "bitwarden"

# Local LLMs
cask "ollama"

# Note Taking
cask "obsidian"

# Online lectures
cask "zoom"

# Browsers
cask "firefox"
cask "google-chrome"

# Visual Studio Code
cask "visual-studio-code"
# Virtual Studio Code extensions
vscode "catppuccin.catppuccin-vsc"
vscode "golang.go"
vscode "hashicorp.hcl"
vscode "hashicorp.terraform"
vscode "ms-python.python"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "redhat.ansible"
vscode "redhat.vscode-yaml"
