# Taps
tap "homebrew/bundle"

# Infrastructure-as-Code
brew "ansible"
brew "ansible-lint"
brew "opentofu"

# SSH Key Management
cask "secretive"

# Default Terminal Replacement
cask "ghostty"
# CLI Tools
brew "broot"
brew "fd"
brew "htop"
brew "ncdu"
brew "macchina"
brew "tig"
brew "tmux"
brew "tree"
brew "wget"

# Programming Languages
# Go
brew "go"
# Rust
brew "rustup"

# Cloud
# Hetzner
brew "hcloud"

# Local Kubernetes / Container Setup
brew "kubernetes-cli"
cask "docker"
brew "podman"
brew "minikube"

# VPNs
# University
cask "tunnelblick"
# Wireguard
brew "wireguard-go"
brew "wireguard-tools"

# Messaging
# Discord
cask "discord"
# Signal
cask "signal"

# Password Manager
cask "bitwarden"

# Local LLMs
cask "ollama"

# Note Taking
cask "obsidian"

# Online lectures
cask "zoom"

# Browsers
cask "firefox"
cask "google-chrome"

# Zed
cask "zed"

# University research
cask "zotero"
