# Taps
tap "homebrew/bundle"
tap "homebrew/cask-fonts"

# Formulas
# Infrastructure-as-Code
brew "ansible"
brew "ansible-lint"
brew "opentofu"
# CLI Tools
brew "bat"
brew "fd"
brew "htop"
brew "ncdu"
brew "neofetch"
brew "ripgrep"
brew "tig"
brew "tmux"
brew "tree"
brew "wget"
# Go
brew "go"
# Hetzner
brew "hcloud"
# Local Kubernetes / Container Setup
brew "kubernetes-cli"
brew "ubuntu/microk8s/microk8s"
brew "podman"

# Casks
cask "font-jetbrains-mono-nerd-font"
cask "kitty"
cask "visual-studio-code"

# Virtual Studio Code extensions
vscode "catppuccin.catppuccin-vsc"
vscode "golang.go"
vscode "hashicorp.hcl"
vscode "hashicorp.terraform"
vscode "ms-python.python"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "redhat.ansible"
vscode "redhat.vscode-yaml"
